{
  "datasets_root": "Datasets",
  "results_root": "Results",
  "retrieve_database_ip": "192.168.0.90",
  "retrieve_database_port": 19530,
  "retrieve_collection_name": "kp20k_train",
  "kp20k_train_path" : "/home/daishengran/deploy/Datasets/kp20k/train.json",
  "bert_path": "/data/daishengran/deploy/sentence_transformers",
  "openchat_path": "/mnt/c2251223-a6be-4a70-9d06-720c65eccb98/daishengran/deploy/Models/openchat_3.5_0106",
  "vicuna_path": "/mnt/c2251223-a6be-4a70-9d06-720c65eccb98/daishengran/deploy/Models/vicuna_7b_v1.5",
  "mistral_path": "/mnt/c2251223-a6be-4a70-9d06-720c65eccb98/daishengran/deploy/Models/Mistral_7B_Instruct_v0.2",
  "sentence_transformers_ip": "192.168.0.237",
  "sentence_transformers_port": 6666,
  "openchat_ip": "192.168.0.90",
  "vicuna_ip": "192.168.0.90",
  "mistral_ip": "192.168.0.90",
  "openchat_port": 5007,
  "vicuna_port": 5006,
  "mistral_port": 5008,
  "polish_prompt_template": "Below is a paragraph from an academic paper. Polish the writing to meet the academic style improve the spelling, grammar, clarity, concision and overall readability. When necessary, rewrite the whole sentence.Paragraph:\n <DOCUMENT>\nNote that you should use synonyms or hypernym phrases to replace something in the text. Try your best to use a variety of expressions. Please response the answer directly without any other irrelevant words.",
  "extract_prompt_template": "Please analyze the provided document:\n<DOCUMENT>\nYour task is to extract exactly <NUM> noun keywords that are directly or not directly from the document text. These keywords should be:\n1. Consisting of 1 to 4 words each.\n2.Closely related to the document's content.\n3.Explicitly or implicitly present within the document itself.\nEnsure the number of extracted keyphrases is exactly <NUM>. Format your response as a complete JSON structure. It should only include the key 'keywords' followed by a list of extracted nouns. For example, your response should look like this: {\"keywords\": [\"keyword1\", \"keyword2\", \"keyword3\"]}. Please do not include any additional explanations or content outside of this JSON structure.",
  "extend_prompt_template": "You are a hypernym and synonym keywords extender. Your task involves analyzing two sets of text:\nA target document, provided as:\n<DOCUMENT>\nA set of keywords extracted from the document, provided as:\n<CANDIDATE>\nYour task is to extend as many as possible common hypernym and synonym keywords of the extracted keywords that not explicitly mentioned in the document text and not in the extracted keywords, but closely align with its topic. These keywords should be:\n1. Consisting of 1 to 4 words each.\n2.Closely related to the document's content.\n3.Must be implicitly associated with the document itself.\n4. Must be not in the candidate set.\nPresent those extended phrases in a JSON format under the key 'answer'. For example, your response should look like this: {\"answer\": [\"keyword1\", \"keyword2\", \"keyword3\"]}.  Note that you can only use double quotes in the json,single quotation marks are not allowed. The generated keywords must not be explicit in the document and must be not in the candidate set. Please do not include any additional explanations or content outside of this JSON structure.",
  "rank_prompt_template_positive": "Your task involves analyzing two sets of text:\n1. A set of candidate phrases, provided as:\n<CANDIDATE>\n2.A target document, provided as:\n<DOCUMENT>\nYour goal is to select exactly <CHOSEN_NUM> phrases from the candidate set that are most relevant to the target document. Keep in mind:\nOnly choose phrases from the provided candidate set.\nAdhere strictly to the specified number <CHOSEN_NUM> of phrases.\nPresent your chosen phrases in a JSON format under the key 'answer'. For example, if you select three phrases, your response should be structured as follows: {\"answer\": [\"phrase1\", \"phrase2\", \"phrase3\"]}. Please do not include any explanations or additional content outside of this format.",
  "rank_prompt_template_negative": "You have a set of candidate phrases:\n<CANDIDATE>\nand a target document:\n<DOCUMENT>\nYour task is to meticulously select exactly <CHOSEN_NUM> phrases from the candidate set that exhibit a high degree of irrelevance to the provided target document. The chosen phrases should poorly align with the topic of the target document. All selected phrases must exclusively come from the candidate phrases set. It's important to note that the absence of these phrases in the target document does not necessarily imply their lack of importance. Your response should be organized in JSON format with the key \"answer\", for example: {\"answer\": [\"a\", \"b\", \"c\"]}, without any additional explanations. However, it's crucial to recognize that explicit phrases are not inherently more important. Only phrases that closely match the topic and content of the target document should be considered important. Strict adherence to the specified number of chosen phrases is imperative; any deviations, whether more or fewer selections, are not allowed."
}